Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13114.h
extern volatile __bit                   C1SP                __at(0x4062);	// @ (0x80C * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x4060);	// @ (0x80C * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x4087);	// @ (0x810 * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x4081);	// @ (0x810 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x4090);	// @ (0x812 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x4092);	// @ (0x812 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x409A);	// @ (0x813 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x4084);	// @ (0x810 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x4080);	// @ (0x810 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// TMR1L<CAL01>
extern volatile __bit                   CAL01               __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 CAL01_bit           _BIT_ACCESS(TMR1L,0)
// TMR1L<CAL11>
extern volatile __bit                   CAL11               __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 CAL11_bit           _BIT_ACCESS(TMR1L,1)
// TMR1L<CAL21>
extern volatile __bit                   CAL21               __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 CAL21_bit           _BIT_ACCESS(TMR1L,2)
// TMR1L<CAL31>
extern volatile __bit                   CAL31               __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 CAL31_bit           _BIT_ACCESS(TMR1L,3)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0xE94C);	// @ (0x1D29 * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0xE94D);	// @ (0x1D29 * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0xE94E);	// @ (0x1D29 * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x2078);	// @ (0x40F * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x2079);	// @ (0x40F * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x207A);	// @ (0x40F * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CAP<CCP1CTS3>
extern volatile __bit                   CCP1CTS3            __at(0x207B);	// @ (0x40F * 8 + 3)
#define                                 CCP1CTS3_bit        _BIT_ACCESS(CCP1CAP,3)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x2077);	// @ (0x40E * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE2<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x4C5);	// @ (0x98 * 8 + 5)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE2,5)
// PIR2<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR2,5)
// PMD1<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x86D);	// @ (0x10D * 8 + 5)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD1,5)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x2070);	// @ (0x40E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x2071);	// @ (0x40E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x2072);	// @ (0x40E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x2073);	// @ (0x40E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0xF0F0);	// @ (0x1E1E * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0xF0F1);	// @ (0x1E1E * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0xF0F2);	// @ (0x1E1E * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0xF0F3);	// @ (0x1E1E * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0xF0F4);	// @ (0x1E1E * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x2098);	// @ (0x413 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x2099);	// @ (0x413 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x209A);	// @ (0x413 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x209B);	// @ (0x413 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x2094);	// @ (0x412 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x4C6);	// @ (0x98 * 8 + 6)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,6)
// PMD1<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x86E);	// @ (0x10D * 8 + 6)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD1,6)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x2090);	// @ (0x412 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x2091);	// @ (0x412 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x2092);	// @ (0x412 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x2093);	// @ (0x412 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF0F8);	// @ (0x1E1F * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF0F9);	// @ (0x1E1F * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF0FA);	// @ (0x1E1F * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF0FB);	// @ (0x1E1F * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF0FC);	// @ (0x1E1F * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1062);	// @ (0x20C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1063);	// @ (0x20C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// ADCG1A<CGA0>
extern volatile __bit                   CGA0                __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCG1A,0)
// ADCG1A<CGA1>
extern volatile __bit                   CGA1                __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCG1A,1)
// ADCG1A<CGA2>
extern volatile __bit                   CGA2                __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCG1A,2)
// ADCG1A<CGA4>
extern volatile __bit                   CGA4                __at(0xE974);	// @ (0x1D2E * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCG1A,4)
// ADCG1A<CGA5>
extern volatile __bit                   CGA5                __at(0xE975);	// @ (0x1D2E * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCG1A,5)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x3C7E);	// @ (0x78F * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x3C7E);	// @ (0x78F * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x3C84);	// @ (0x790 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x3C84);	// @ (0x790 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// T2HLT<CKPOL>
extern volatile __bit                   CKPOL               __at(0x1C7E);	// @ (0x38F * 8 + 6)
#define                                 CKPOL_bit           _BIT_ACCESS(T2HLT,6)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// T2HLT<CKSYNC>
extern volatile __bit                   CKSYNC              __at(0x1C7D);	// @ (0x38F * 8 + 5)
#define                                 CKSYNC_bit          _BIT_ACCESS(T2HLT,5)
// PIE7<CLB1IE0>
extern volatile __bit                   CLB1IE0             __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 CLB1IE0_bit         _BIT_ACCESS(PIE7,0)
// PIE7<CLB1IE1>
extern volatile __bit                   CLB1IE1             __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 CLB1IE1_bit         _BIT_ACCESS(PIE7,1)
// PIE7<CLB1IE2>
extern volatile __bit                   CLB1IE2             __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CLB1IE2_bit         _BIT_ACCESS(PIE7,2)
// PIE7<CLB1IE3>
extern volatile __bit                   CLB1IE3             __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CLB1IE3_bit         _BIT_ACCESS(PIE7,3)
// PIR7<CLB1IF0>
extern volatile __bit                   CLB1IF0             __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLB1IF0_bit         _BIT_ACCESS(PIR7,0)
// PIR7<CLB1IF1>
extern volatile __bit                   CLB1IF1             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLB1IF1_bit         _BIT_ACCESS(PIR7,1)
// PIR7<CLB1IF2>
extern volatile __bit                   CLB1IF2             __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLB1IF2_bit         _BIT_ACCESS(PIR7,2)
// PIR7<CLB1IF3>
extern volatile __bit                   CLB1IF3             __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLB1IF3_bit         _BIT_ACCESS(PIR7,3)
// CLBCON<CLBEN>
extern volatile __bit                   CLBEN               __at(0x2867);	// @ (0x50C * 8 + 7)
#define                                 CLBEN_bit           _BIT_ACCESS(CLBCON,7)
// PMD4<CLBMD>
extern volatile __bit                   CLBMD               __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 CLBMD_bit           _BIT_ACCESS(PMD4,7)
// CLBSWINL<CLBSWIN0>
extern volatile __bit                   CLBSWIN0            __at(0x2880);	// @ (0x510 * 8 + 0)
#define                                 CLBSWIN0_bit        _BIT_ACCESS(CLBSWINL,0)
// CLBSWINL<CLBSWIN1>
extern volatile __bit                   CLBSWIN1            __at(0x2881);	// @ (0x510 * 8 + 1)
#define                                 CLBSWIN1_bit        _BIT_ACCESS(CLBSWINL,1)
// CLBSWINM<CLBSWIN10>
extern volatile __bit                   CLBSWIN10           __at(0x287A);	// @ (0x50F * 8 + 2)
#define                                 CLBSWIN10_bit       _BIT_ACCESS(CLBSWINM,2)
// CLBSWINM<CLBSWIN11>
extern volatile __bit                   CLBSWIN11           __at(0x287B);	// @ (0x50F * 8 + 3)
#define                                 CLBSWIN11_bit       _BIT_ACCESS(CLBSWINM,3)
// CLBSWINM<CLBSWIN12>
extern volatile __bit                   CLBSWIN12           __at(0x287C);	// @ (0x50F * 8 + 4)
#define                                 CLBSWIN12_bit       _BIT_ACCESS(CLBSWINM,4)
// CLBSWINM<CLBSWIN13>
extern volatile __bit                   CLBSWIN13           __at(0x287D);	// @ (0x50F * 8 + 5)
#define                                 CLBSWIN13_bit       _BIT_ACCESS(CLBSWINM,5)
// CLBSWINM<CLBSWIN14>
extern volatile __bit                   CLBSWIN14           __at(0x287E);	// @ (0x50F * 8 + 6)
#define                                 CLBSWIN14_bit       _BIT_ACCESS(CLBSWINM,6)
// CLBSWINM<CLBSWIN15>
extern volatile __bit                   CLBSWIN15           __at(0x287F);	// @ (0x50F * 8 + 7)
#define                                 CLBSWIN15_bit       _BIT_ACCESS(CLBSWINM,7)
// CLBSWINH<CLBSWIN16>
extern volatile __bit                   CLBSWIN16           __at(0x2870);	// @ (0x50E * 8 + 0)
#define                                 CLBSWIN16_bit       _BIT_ACCESS(CLBSWINH,0)
// CLBSWINH<CLBSWIN17>
extern volatile __bit                   CLBSWIN17           __at(0x2871);	// @ (0x50E * 8 + 1)
#define                                 CLBSWIN17_bit       _BIT_ACCESS(CLBSWINH,1)
// CLBSWINH<CLBSWIN18>
extern volatile __bit                   CLBSWIN18           __at(0x2872);	// @ (0x50E * 8 + 2)
#define                                 CLBSWIN18_bit       _BIT_ACCESS(CLBSWINH,2)
// CLBSWINH<CLBSWIN19>
extern volatile __bit                   CLBSWIN19           __at(0x2873);	// @ (0x50E * 8 + 3)
#define                                 CLBSWIN19_bit       _BIT_ACCESS(CLBSWINH,3)
// CLBSWINL<CLBSWIN2>
extern volatile __bit                   CLBSWIN2            __at(0x2882);	// @ (0x510 * 8 + 2)
#define                                 CLBSWIN2_bit        _BIT_ACCESS(CLBSWINL,2)
// CLBSWINH<CLBSWIN20>
extern volatile __bit                   CLBSWIN20           __at(0x2874);	// @ (0x50E * 8 + 4)
#define                                 CLBSWIN20_bit       _BIT_ACCESS(CLBSWINH,4)
// CLBSWINH<CLBSWIN21>
extern volatile __bit                   CLBSWIN21           __at(0x2875);	// @ (0x50E * 8 + 5)
#define                                 CLBSWIN21_bit       _BIT_ACCESS(CLBSWINH,5)
// CLBSWINH<CLBSWIN22>
extern volatile __bit                   CLBSWIN22           __at(0x2876);	// @ (0x50E * 8 + 6)
#define                                 CLBSWIN22_bit       _BIT_ACCESS(CLBSWINH,6)
// CLBSWINH<CLBSWIN23>
extern volatile __bit                   CLBSWIN23           __at(0x2877);	// @ (0x50E * 8 + 7)
#define                                 CLBSWIN23_bit       _BIT_ACCESS(CLBSWINH,7)
// CLBSWINU<CLBSWIN24>
extern volatile __bit                   CLBSWIN24           __at(0x2868);	// @ (0x50D * 8 + 0)
#define                                 CLBSWIN24_bit       _BIT_ACCESS(CLBSWINU,0)
// CLBSWINU<CLBSWIN25>
extern volatile __bit                   CLBSWIN25           __at(0x2869);	// @ (0x50D * 8 + 1)
#define                                 CLBSWIN25_bit       _BIT_ACCESS(CLBSWINU,1)
// CLBSWINU<CLBSWIN26>
extern volatile __bit                   CLBSWIN26           __at(0x286A);	// @ (0x50D * 8 + 2)
#define                                 CLBSWIN26_bit       _BIT_ACCESS(CLBSWINU,2)
// CLBSWINU<CLBSWIN27>
extern volatile __bit                   CLBSWIN27           __at(0x286B);	// @ (0x50D * 8 + 3)
#define                                 CLBSWIN27_bit       _BIT_ACCESS(CLBSWINU,3)
// CLBSWINU<CLBSWIN28>
extern volatile __bit                   CLBSWIN28           __at(0x286C);	// @ (0x50D * 8 + 4)
#define                                 CLBSWIN28_bit       _BIT_ACCESS(CLBSWINU,4)
// CLBSWINU<CLBSWIN29>
extern volatile __bit                   CLBSWIN29           __at(0x286D);	// @ (0x50D * 8 + 5)
#define                                 CLBSWIN29_bit       _BIT_ACCESS(CLBSWINU,5)
// CLBSWINL<CLBSWIN3>
extern volatile __bit                   CLBSWIN3            __at(0x2883);	// @ (0x510 * 8 + 3)
#define                                 CLBSWIN3_bit        _BIT_ACCESS(CLBSWINL,3)
// CLBSWINU<CLBSWIN30>
extern volatile __bit                   CLBSWIN30           __at(0x286E);	// @ (0x50D * 8 + 6)
#define                                 CLBSWIN30_bit       _BIT_ACCESS(CLBSWINU,6)
// CLBSWINU<CLBSWIN31>
extern volatile __bit                   CLBSWIN31           __at(0x286F);	// @ (0x50D * 8 + 7)
#define                                 CLBSWIN31_bit       _BIT_ACCESS(CLBSWINU,7)
// CLBSWINL<CLBSWIN4>
extern volatile __bit                   CLBSWIN4            __at(0x2884);	// @ (0x510 * 8 + 4)
#define                                 CLBSWIN4_bit        _BIT_ACCESS(CLBSWINL,4)
// CLBSWINL<CLBSWIN5>
extern volatile __bit                   CLBSWIN5            __at(0x2885);	// @ (0x510 * 8 + 5)
#define                                 CLBSWIN5_bit        _BIT_ACCESS(CLBSWINL,5)
// CLBSWINL<CLBSWIN6>
extern volatile __bit                   CLBSWIN6            __at(0x2886);	// @ (0x510 * 8 + 6)
