Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13114.h
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATAH,6)
// CRCDATAH<DATA15>
extern volatile __bit                   DATA15              __at(0xE4F7);	// @ (0x1C9E * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATAH,7)
// CRCDATAU<DATA16>
extern volatile __bit                   DATA16              __at(0xE4F8);	// @ (0x1C9F * 8 + 0)
#define                                 DATA16_bit          _BIT_ACCESS(CRCDATAU,0)
// CRCDATAU<DATA17>
extern volatile __bit                   DATA17              __at(0xE4F9);	// @ (0x1C9F * 8 + 1)
#define                                 DATA17_bit          _BIT_ACCESS(CRCDATAU,1)
// CRCDATAU<DATA18>
extern volatile __bit                   DATA18              __at(0xE4FA);	// @ (0x1C9F * 8 + 2)
#define                                 DATA18_bit          _BIT_ACCESS(CRCDATAU,2)
// CRCDATAU<DATA19>
extern volatile __bit                   DATA19              __at(0xE4FB);	// @ (0x1C9F * 8 + 3)
#define                                 DATA19_bit          _BIT_ACCESS(CRCDATAU,3)
// CRCDATAL<DATA2>
extern volatile __bit                   DATA2               __at(0xE4EA);	// @ (0x1C9D * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATAL,2)
// CRCDATAU<DATA20>
extern volatile __bit                   DATA20              __at(0xE4FC);	// @ (0x1C9F * 8 + 4)
#define                                 DATA20_bit          _BIT_ACCESS(CRCDATAU,4)
// CRCDATAU<DATA21>
extern volatile __bit                   DATA21              __at(0xE4FD);	// @ (0x1C9F * 8 + 5)
#define                                 DATA21_bit          _BIT_ACCESS(CRCDATAU,5)
// CRCDATAU<DATA22>
extern volatile __bit                   DATA22              __at(0xE4FE);	// @ (0x1C9F * 8 + 6)
#define                                 DATA22_bit          _BIT_ACCESS(CRCDATAU,6)
// CRCDATAU<DATA23>
extern volatile __bit                   DATA23              __at(0xE4FF);	// @ (0x1C9F * 8 + 7)
#define                                 DATA23_bit          _BIT_ACCESS(CRCDATAU,7)
// CRCDATAT<DATA24>
extern volatile __bit                   DATA24              __at(0xE500);	// @ (0x1CA0 * 8 + 0)
#define                                 DATA24_bit          _BIT_ACCESS(CRCDATAT,0)
// CRCDATAT<DATA25>
extern volatile __bit                   DATA25              __at(0xE501);	// @ (0x1CA0 * 8 + 1)
#define                                 DATA25_bit          _BIT_ACCESS(CRCDATAT,1)
// CRCDATAT<DATA26>
extern volatile __bit                   DATA26              __at(0xE502);	// @ (0x1CA0 * 8 + 2)
#define                                 DATA26_bit          _BIT_ACCESS(CRCDATAT,2)
// CRCDATAT<DATA27>
extern volatile __bit                   DATA27              __at(0xE503);	// @ (0x1CA0 * 8 + 3)
#define                                 DATA27_bit          _BIT_ACCESS(CRCDATAT,3)
// CRCDATAT<DATA28>
extern volatile __bit                   DATA28              __at(0xE504);	// @ (0x1CA0 * 8 + 4)
#define                                 DATA28_bit          _BIT_ACCESS(CRCDATAT,4)
// CRCDATAT<DATA29>
extern volatile __bit                   DATA29              __at(0xE505);	// @ (0x1CA0 * 8 + 5)
#define                                 DATA29_bit          _BIT_ACCESS(CRCDATAT,5)
// CRCDATAL<DATA3>
extern volatile __bit                   DATA3               __at(0xE4EB);	// @ (0x1C9D * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATAL,3)
// CRCDATAT<DATA30>
extern volatile __bit                   DATA30              __at(0xE506);	// @ (0x1CA0 * 8 + 6)
#define                                 DATA30_bit          _BIT_ACCESS(CRCDATAT,6)
// CRCDATAT<DATA31>
extern volatile __bit                   DATA31              __at(0xE507);	// @ (0x1CA0 * 8 + 7)
#define                                 DATA31_bit          _BIT_ACCESS(CRCDATAT,7)
// CRCDATAL<DATA4>
extern volatile __bit                   DATA4               __at(0xE4EC);	// @ (0x1C9D * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATAL,4)
// CRCDATAL<DATA5>
extern volatile __bit                   DATA5               __at(0xE4ED);	// @ (0x1C9D * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATAL,5)
// CRCDATAL<DATA6>
extern volatile __bit                   DATA6               __at(0xE4EE);	// @ (0x1C9D * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATAL,6)
// CRCDATAL<DATA7>
extern volatile __bit                   DATA7               __at(0xE4EF);	// @ (0x1C9D * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATAL,7)
// CRCDATAH<DATA8>
extern volatile __bit                   DATA8               __at(0xE4F0);	// @ (0x1C9E * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATAH,0)
// CRCDATAH<DATA9>
extern volatile __bit                   DATA9               __at(0xE4F1);	// @ (0x1C9E * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATAH,1)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x3C90);	// @ (0x792 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// CRCCON2<DLEN0>
extern volatile __bit                   DLEN0               __at(0xE538);	// @ (0x1CA7 * 8 + 0)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON2,0)
// CRCCON2<DLEN1>
extern volatile __bit                   DLEN1               __at(0xE539);	// @ (0x1CA7 * 8 + 1)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON2,1)
// CRCCON2<DLEN2>
extern volatile __bit                   DLEN2               __at(0xE53A);	// @ (0x1CA7 * 8 + 2)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON2,2)
// CRCCON2<DLEN3>
extern volatile __bit                   DLEN3               __at(0xE53B);	// @ (0x1CA7 * 8 + 3)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON2,3)
// CRCCON2<DLEN4>
extern volatile __bit                   DLEN4               __at(0xE53C);	// @ (0x1CA7 * 8 + 4)
#define                                 DLEN4_bit           _BIT_ACCESS(CRCCON2,4)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0xE930);	// @ (0x1D26 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// SCANDPS<DPS>
extern volatile __bit                   DPS                 __at(0xE4C8);	// @ (0x1C99 * 8 + 0)
#define                                 DPS_bit             _BIT_ACCESS(SCANDPS,0)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0xE938);	// @ (0x1D27 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// SSP1STAT<D_A>
extern volatile __bit                   D_A                 __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_A1>
extern volatile __bit                   D_A1                __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 D_A1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_nA1>
extern volatile __bit                   D_nA1               __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 D_nA1_bit           _BIT_ACCESS(SSP1STAT,5)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0xE880);	// @ (0x1D10 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0xE881);	// @ (0x1D10 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0xE88A);	// @ (0x1D11 * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0xE88B);	// @ (0x1D11 * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0xE88C);	// @ (0x1D11 * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0xE88D);	// @ (0x1D11 * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0xE88E);	// @ (0x1D11 * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0xE88F);	// @ (0x1D11 * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0xE882);	// @ (0x1D10 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0xE883);	// @ (0x1D10 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0xE884);	// @ (0x1D10 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0xE885);	// @ (0x1D10 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0xE886);	// @ (0x1D10 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0xE887);	// @ (0x1D10 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0xE888);	// @ (0x1D11 * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0xE889);	// @ (0x1D11 * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x148F);	// @ (0x291 * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x1487);	// @ (0x290 * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0x3882);	// @ (0x710 * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0xE8A0);	// @ (0x1D14 * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0xE8A1);	// @ (0x1D14 * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0xE8AA);	// @ (0x1D15 * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0xE8AB);	// @ (0x1D15 * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0xE8AC);	// @ (0x1D15 * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0xE8AD);	// @ (0x1D15 * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0xE8AE);	// @ (0x1D15 * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0xE8AF);	// @ (0x1D15 * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0xE8A2);	// @ (0x1D14 * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0xE8A3);	// @ (0x1D14 * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0xE8A4);	// @ (0x1D14 * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0xE8A5);	// @ (0x1D14 * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0xE8A6);	// @ (0x1D14 * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0xE8A7);	// @ (0x1D14 * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0xE8A8);	// @ (0x1D15 * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0xE8A9);	// @ (0x1D15 * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0xE932);	// @ (0x1D26 * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// NVMCON1<FREE>
extern volatile __bit                   FREE                __at(0xE484);	// @ (0x1C90 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(NVMCON1,4)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0xE528);	// @ (0x1CA5 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x1067);	// @ (0x20C * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD3<FVRMD>
extern volatile __bit                   FVRMD               __at(0x87D);	// @ (0x10F * 8 + 5)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD3,5)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x1066);	// @ (0x20C * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CLCnGLS0<G1D1N>
extern volatile __bit                   G1D1N               __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 G1D1N_bit           _BIT_ACCESS(CLCnGLS0,0)
// CLCnGLS0<G1D1T>
extern volatile __bit                   G1D1T               __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 G1D1T_bit           _BIT_ACCESS(CLCnGLS0,1)
// CLCnGLS0<G1D2N>
extern volatile __bit                   G1D2N               __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 G1D2N_bit           _BIT_ACCESS(CLCnGLS0,2)
// CLCnGLS0<G1D2T>
extern volatile __bit                   G1D2T               __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 G1D2T_bit           _BIT_ACCESS(CLCnGLS0,3)
// CLCnGLS0<G1D3N>
extern volatile __bit                   G1D3N               __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 G1D3N_bit           _BIT_ACCESS(CLCnGLS0,4)
// CLCnGLS0<G1D3T>
extern volatile __bit                   G1D3T               __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 G1D3T_bit           _BIT_ACCESS(CLCnGLS0,5)
// CLCnGLS0<G1D4N>
extern volatile __bit                   G1D4N               __at(0x3496);	// @ (0x692 * 8 + 6)
#define                                 G1D4N_bit           _BIT_ACCESS(CLCnGLS0,6)
// CLCnGLS0<G1D4T>
extern volatile __bit                   G1D4T               __at(0x3497);	// @ (0x692 * 8 + 7)
#define                                 G1D4T_bit           _BIT_ACCESS(CLCnGLS0,7)
// CLCnPOL<G1POL>
extern volatile __bit                   G1POL               __at(0x3468);	// @ (0x68D * 8 + 0)
#define                                 G1POL_bit           _BIT_ACCESS(CLCnPOL,0)
// CLCnGLS1<G2D1N>
extern volatile __bit                   G2D1N               __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 G2D1N_bit           _BIT_ACCESS(CLCnGLS1,0)
// CLCnGLS1<G2D1T>
extern volatile __bit                   G2D1T               __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 G2D1T_bit           _BIT_ACCESS(CLCnGLS1,1)
// CLCnGLS1<G2D2N>
extern volatile __bit                   G2D2N               __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 G2D2N_bit           _BIT_ACCESS(CLCnGLS1,2)
// CLCnGLS1<G2D2T>
extern volatile __bit                   G2D2T               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 G2D2T_bit           _BIT_ACCESS(CLCnGLS1,3)
// CLCnGLS1<G2D3N>
extern volatile __bit                   G2D3N               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 G2D3N_bit           _BIT_ACCESS(CLCnGLS1,4)
// CLCnGLS1<G2D3T>
extern volatile __bit                   G2D3T               __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 G2D3T_bit           _BIT_ACCESS(CLCnGLS1,5)
// CLCnGLS1<G2D4N>
extern volatile __bit                   G2D4N               __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 G2D4N_bit           _BIT_ACCESS(CLCnGLS1,6)
// CLCnGLS1<G2D4T>
extern volatile __bit                   G2D4T               __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 G2D4T_bit           _BIT_ACCESS(CLCnGLS1,7)
// CLCnPOL<G2POL>
extern volatile __bit                   G2POL               __at(0x3469);	// @ (0x68D * 8 + 1)
#define                                 G2POL_bit           _BIT_ACCESS(CLCnPOL,1)
// CLCnGLS2<G3D1N>
extern volatile __bit                   G3D1N               __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 G3D1N_bit           _BIT_ACCESS(CLCnGLS2,0)
// CLCnGLS2<G3D1T>
extern volatile __bit                   G3D1T               __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 G3D1T_bit           _BIT_ACCESS(CLCnGLS2,1)
// CLCnGLS2<G3D2N>
extern volatile __bit                   G3D2N               __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 G3D2N_bit           _BIT_ACCESS(CLCnGLS2,2)
// CLCnGLS2<G3D2T>
extern volatile __bit                   G3D2T               __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 G3D2T_bit           _BIT_ACCESS(CLCnGLS2,3)
// CLCnGLS2<G3D3N>
extern volatile __bit                   G3D3N               __at(0x34A4);	// @ (0x694 * 8 + 4)
#define                                 G3D3N_bit           _BIT_ACCESS(CLCnGLS2,4)
// CLCnGLS2<G3D3T>
extern volatile __bit                   G3D3T               __at(0x34A5);	// @ (0x694 * 8 + 5)
#define                                 G3D3T_bit           _BIT_ACCESS(CLCnGLS2,5)
// CLCnGLS2<G3D4N>
extern volatile __bit                   G3D4N               __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 G3D4N_bit           _BIT_ACCESS(CLCnGLS2,6)
// CLCnGLS2<G3D4T>
extern volatile __bit                   G3D4T               __at(0x34A7);	// @ (0x694 * 8 + 7)
#define                                 G3D4T_bit           _BIT_ACCESS(CLCnGLS2,7)
// CLCnPOL<G3POL>
extern volatile __bit                   G3POL               __at(0x346A);	// @ (0x68D * 8 + 2)
#define                                 G3POL_bit           _BIT_ACCESS(CLCnPOL,2)
// CLCnGLS3<G4D1N>
extern volatile __bit                   G4D1N               __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 G4D1N_bit           _BIT_ACCESS(CLCnGLS3,0)
// CLCnGLS3<G4D1T>
extern volatile __bit                   G4D1T               __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 G4D1T_bit           _BIT_ACCESS(CLCnGLS3,1)
// CLCnGLS3<G4D2N>
extern volatile __bit                   G4D2N               __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 G4D2N_bit           _BIT_ACCESS(CLCnGLS3,2)
// CLCnGLS3<G4D2T>
extern volatile __bit                   G4D2T               __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 G4D2T_bit           _BIT_ACCESS(CLCnGLS3,3)
// CLCnGLS3<G4D3N>
extern volatile __bit                   G4D3N               __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 G4D3N_bit           _BIT_ACCESS(CLCnGLS3,4)
// CLCnGLS3<G4D3T>
extern volatile __bit                   G4D3T               __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 G4D3T_bit           _BIT_ACCESS(CLCnGLS3,5)
// CLCnGLS3<G4D4N>
extern volatile __bit                   G4D4N               __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 G4D4N_bit           _BIT_ACCESS(CLCnGLS3,6)
// CLCnGLS3<G4D4T>
